aroum/dmk/platforms/nrf52840/pin_defs.h
#ifndef PIN_DEFS_H
#define PIN_DEFS_H

#include <stdint.h>

// nRF52840: P0_00-P0_31, P1_00-P1_15
typedef uint32_t pin_t;

#define P0_00 0x00000000
#define P0_01 0x00000001
#define P0_02 0x00000002
#define P0_03 0x00000003
#define P0_04 0x00000004
#define P0_05 0x00000005
#define P0_06 0x00000006
#define P0_07 0x00000007
#define P0_08 0x00000008
#define P0_09 0x00000009
#define P0_10 0x0000000A
#define P0_11 0x0000000B
#define P0_12 0x0000000C
#define P0_13 0x0000000D
#define P0_14 0x0000000E
#define P0_15 0x0000000F
#define P0_16 0x00000010
#define P0_17 0x00000011
#define P0_18 0x00000012
#define P0_19 0x00000013
#define P0_20 0x00000014
#define P0_21 0x00000015
#define P0_22 0x00000016
#define P0_23 0x00000017
#define P0_24 0x00000018
#define P0_25 0x00000019
#define P0_26 0x0000001A
#define P0_27 0x0000001B
#define P0_28 0x0000001C
#define P0_29 0x0000001D
#define P0_30 0x0000001E
#define P0_31 0x0000001F
#define P1_00 32
#define P1_01 33
#define P1_02 34
#define P1_03 35
#define P1_04 36
#define P1_05 37
#define P1_06 38
#define P1_07 39
#define P1_08 40
#define P1_09 41
#define P1_10 42
#define P1_11 43
#define P1_12 44
#define P1_13 45
#define P1_14 46
#define P1_15 47

#include "proMicro_pins.h"

#endif // PIN_DEFS_H
